Revit 2027 API
ParameterTypeId.EnergyAnalysisSkylightWidth Property
 "Skylight Width & Depth": Deprecated.
Namespace: Autodesk.Revit.DB
Assembly: RevitAPI (in RevitAPI.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
public static ForgeTypeId EnergyAnalysisSkylightWidth { get; }
Public Shared ReadOnly Property EnergyAnalysisSkylightWidth As ForgeTypeId
	Get
public:
static property ForgeTypeId^ EnergyAnalysisSkylightWidth {
	ForgeTypeId^ get ();
}
static member EnergyAnalysisSkylightWidth : ForgeTypeId with get
Property Value
ForgeTypeId
See Also
Reference
ParameterTypeId Class
Autodesk.Revit.DB Namespace